#---------------------Task-1--------------------------

a = 100
b = 200
print("a = " + str(a) + " b = " + str(b))

c = input("Введите любое положительное число: ")
print("Вы ввели число: " + c)

#-----------------------------------------------------

#---------------------Task-2--------------------------

d = input("Введите любое положительное число: ")
print("Прибавим к вашему числу " + str(d) + " еще 2 и получим в сумме: " + str(int(d) + 2))

#-----------------------------------------------------

#---------------------Task-3--------------------------

f = input("Сколько вам лет: ")
if int(f) < 18:
    print("Извините, пользование данным ресурсом только с 18 лет")
else:
    print("Доступ разрешен")

#-----------------------------------------------------
