
from collections import Counter
import math, random

print("---------------------Task-1--------------------------\n")

spisok1 = [2, 4, -80, 6, 7, -67, 45, 25, 64, -3, 81]
spisok2 = []
x = 0

for i in range(len(spisok1)):
    if spisok1[i] > 0:
        if (math.sqrt(spisok1[i])).is_integer() is True:
            spisok2.insert(x, int(math.sqrt(spisok1[i])))
            x += 1

print(spisok2)

print("\n-----------------------------------------------------\n")

print("---------------------Task-2--------------------------\n")

date = input("Введите дату в формате 'dd.mm.yyyy': ")
days = ["Первое", "Второе", "Третье", "Четвертое", "Пятое", "Шестое", "Седьмое", "Восьмое", "Девятое", "Десятое", "Одиннадцатое",
        "Двенадцатое", "Тренадцатое", "Четырнадцатое", "Пятнадцатое", "Шестнадцатое", "Семнадцатое", "Восемнадцатое", "Девятнадцатое",
        "Двадцатое", "Двадцатрь первое", "Двадцать второе", "Двадцать третье", "Двадцать четвертое", "Двадцать пятое", "Двадцать шестое",
        "Двадцать седьмое", "Двадцать восьмое", "Двадцать девятое", "Тридцатое", "Тридцать первое"]
months = ["января", "февраля", "марта", "апреля", "мая", "июня", "июля", "августа", "сентября", "октября", "ноября", "декабря"]

print(days[int(date[:2])-1], months[int(date[3:5])-1], date[6:] + " года")


print("\n-----------------------------------------------------\n")

print("---------------------Task-3--------------------------\n")

n = int(input("Введите количество чисел в списке: "))
spisok = []
for i in range(0, n):
    spisok.insert(i, random.randint(-100, 100))

print("\n", spisok)

print("\n-----------------------------------------------------\n")

print("---------------------Task-4--------------------------\n")

spisok = [1, 2, 5, 2, 7, 8, 2, 3, 1, 3, 6, 8, 1, 9, 10, 5]
spisok_a = []
spisok_b = []

for i in spisok:
    if i not in spisok_a:
        spisok_a.append(i)

print("Spisok = ", spisok)
print("Spisok A = ", spisok_a)
print("Spisok B = ", list([k for k, v in Counter(spisok).items() if v == 1]))

print("\n-----------------------------------------------------\n")