
print("---------------------Task-1--------------------------\n")

def info_human(name, years, city):
    print(name + "," + years + " год(а), проживает в городе" + city)

n, y, c = input("Введите имя, возраст и город проживания через запятую: ").split(',')
info_human(n, y, c)

print("\n-----------------------------------------------------\n")

print("---------------------Task-2--------------------------\n")

def max_number(x1, x2, x3):
    print("Максимальное число: " + str(max(int(x1), int(x2), int(x3))))

number1, number2, number3 = input("Введите три числа через запятую: ").split(',')
max_number(number1, number2, number3)

print("\n-----------------------------------------------------\n")

print("---------------------Task-3--------------------------\n")

def len_str(*args):
    print("Самая длинная строка получается: " + max(*args, key=len))

len_str(input("Введите различные слова различной длинны через запятую: ").split(','))

print("\n-----------------------------------------------------")
